jmeter/reports/dashboard/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 922.3721500000021,
    "medianResTime" : 1001.0,
    "minResTime" : 7.0,
    "maxResTime" : 1999.0,
    "pct1ResTime" : 1410.0,
    "pct2ResTime" : 1493.0,
    "pct3ResTime" : 1590.0,
    "throughput" : 686.8367732408393,
    "receivedKBytesPerSec" : 440.38240039793607,
    "sentKBytesPerSec" : 136.25573884319516
  },
  "GET /api/bbs/article/search" : {
    "transaction" : "GET /api/bbs/article/search",
    "sampleCount" : 20000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 922.3721500000021,
    "medianResTime" : 1001.0,
    "minResTime" : 7.0,
    "maxResTime" : 1999.0,
    "pct1ResTime" : 1410.0,
    "pct2ResTime" : 1493.0,
    "pct3ResTime" : 1590.0,
    "throughput" : 686.8367732408393,
    "receivedKBytesPerSec" : 440.38240039793607,
    "sentKBytesPerSec" : 136.25573884319516
  }
}